app/controllers/users_controller.rb

  def create
    puts "-------------- #{current_user}"
    @user = User.user_create(params[:user], current_user) #new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `created_user_id`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `first_name`, `is_admin`, `last_login_at`, `last_login_ip`, `last_name`, `last_request_at`, `login_count`, `password_salt`, `perishable_token`, `persistence_token`, `phone_number`, `role_id`, `single_access_token`, `state`, `updated_at`) VALUES ('2012-05-26 17:50:03', 1, 'a2e29265ffe6ade0df958f14318ce8009e4a375be48cf124098a2569d49d4af040c411a9631876cfa851cf2eea02c8f9073b3a54a0181a64dd59eeaafbfd9ecc', NULL, NULL, 'test1@test.com', 0, 'test', 0, NULL, NULL, 'test', NULL, 0, 'ZJFGfCiQIqfBb2l9RFS', 'x2Rz5I4KidjEcUsONvd', 'f4af95a0f1198bc8f6c37f52ecd5780df5c2d1d23203f60f2bece1d63fcbe0405b7331739b90b04267e8dd10fd2afa5043ccbaa32f92c94b819ede0fa3ccb0c6', 1231231231, 3, 'EYwS8sQ1xlRfCJ29evTW', 'pending', '2012-05-26 17:50:03')
UPDATE `users` SET `last_request_at` = '2012-05-26 17:38:32', `perishable_token` = 'GFJTmBsivPrc4aAm3U3', `updated_at` = '2012-05-26 17:38:32' WHERE `users`.`id` = 1